#include <stdio.h>
#include < Windows.h >
#define SH 10
int main() {
	int i, j, i1, j1, kolvo, pok, alive;
	char dvmas[SH][SH] = {{'+','-','-','-','-','-','-','-','-','+'},
						   {'|','#',' ',' ','#',' ','#',' ','#','|'},
						   {'|',' ','#','#','#','#',' ',' ',' ','|'},
						   {'|',' ','#',' ',' ',' ','#','#',' ','|'},
						   {'|','#',' ','#','#',' ',' ',' ',' ','|'},
						   {'|',' ',' ','#',' ','#','#',' ','#','|'},
						   {'|','#','#',' ','#',' ',' ','#',' ','|'},
						   {'|',' ',' ',' ','#',' ','#',' ',' ','|'},
						   {'|','#',' ','#',' ','#',' ',' ','#','|'},
						   {'+','-','-','-','-','-','-','-','-','+'} };
	char dvmas2[SH][SH] = { {'+','-','-','-','-','-','-','-','-','+'},
						   {'|',' ',' ',' ',' ',' ',' ',' ',' ','|'},
						   {'|',' ',' ',' ',' ',' ',' ',' ',' ','|'},
						   {'|',' ',' ',' ',' ',' ',' ',' ',' ','|'},
						   {'|',' ',' ',' ',' ',' ',' ',' ',' ','|'},
						   {'|',' ',' ',' ',' ',' ',' ',' ',' ','|'},
						   {'|',' ',' ',' ',' ',' ',' ',' ',' ','|'},
						   {'|',' ',' ',' ',' ',' ',' ',' ',' ','|'},
						   {'|',' ',' ',' ',' ',' ',' ',' ',' ','|'},
						   {'+','-','-','-','-','-','-','-','-','+'} };
	SetConsoleCP(1251); //установка кодовой страницы win-cp 1251 в поток ввода
	SetConsoleOutputCP(1251); //установка кодовой страницы win-cp 1251 в поток вывода
	system("cls");       // очищаем окно консоли
	for (i = 0; i < SH; ++i) { // вывод массива
		for (j = 0; j < SH; ++j) {
			printf("%c", dvmas[i][j]);
		}
		printf("\n");
	} //
	printf("Поколение 0 Количество живых клеток: 28");
	pok = 0;
	for (;;) {
		++pok;
		system("cls"); // очищаем окно консоли
		for (i = 1; i < SH - 1; ++i) {
			for (j = 1; j < SH - 1; ++j) {
				kolvo = 0;
				alive = 0;
				for (i1 = i - 1; i1 <= i + 1; ++i1) { // проверка "рамки" вокруг dvmas[i][j]
					for (j1 = j - 1; j1 <= j + 1; ++j1) {
						if ((i1 != i) || (j1 != j)) {
							if (dvmas[i1][j1] == '#')
								++kolvo;
						} 
					}
				}//
				if (dvmas[i][j] == '#') { // продолжение жизни живой клетки
					if (kolvo == 2 || kolvo == 3)
						dvmas2[i][j] = '#'; 
					else // смерть клетки
						dvmas2[i][j] = ' ';
				}
				else { // воскрешение мертвой клетки
					if (kolvo == 3)
						dvmas2[i][j] = '#';
					else
						dvmas2[i][j] = ' ';
				} //
			}
			printf("\n");
		}

		for (i = 0; i < SH; ++i) { // перенос массива dvmas2 в dvmas
			for (j = 0; j < SH; ++j) {
				dvmas[i][j] = dvmas2[i][j];
				++alive;
			}
		} //
		for (i = 0; i < SH; ++i) { // вывод массива
			for (j = 0; j < SH; ++j) {
				printf("%c", dvmas[i][j]);
			}
			printf("\n");
		} //
		printf("Поколение %d Количество живых клеток: %d",pok,alive); // вывод дополгительной информации
		Sleep(300);
	}
}